In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

ModuleNotFoundError: No module named 'pandas'

In [3]:
df = pd.DataFrame(randn(3,4),["a","b","c"],["Column1","Column2","Column3","Column4"])

In [4]:
df

    Column1   Column2   Column3   Column4
a -1.828176  0.868624  0.806492  0.779450
b -0.387825 -0.021886 -1.544030 -0.397330
c  0.117369 -0.014371 -1.575668 -1.273715

In [5]:
df < 0.5

   Column1  Column2  Column3  Column4
a     True    False    False    False
b     True     True     True     True
c     True     True     True     True

In [6]:
booleanDf = df < 0.5

In [7]:
booleanDf

   Column1  Column2  Column3  Column4
a     True    False    False    False
b     True     True     True     True
c     True     True     True     True

In [8]:
df[booleanDf]

    Column1   Column2   Column3   Column4
a -1.828176       NaN       NaN       NaN
b -0.387825 -0.021886 -1.544030 -0.397330
c  0.117369 -0.014371 -1.575668 -1.273715

In [9]:
df["Column1"]

a   -1.828176
b   -0.387825
c    0.117369
Name: Column1, dtype: float64

In [10]:
df[df["Column1"] < -0.5]

    Column1   Column2   Column3  Column4
a -1.828176  0.868624  0.806492  0.77945

In [11]:
df[df["Column1"] < 0]

    Column1   Column2   Column3  Column4
a -1.828176  0.868624  0.806492  0.77945
b -0.387825 -0.021886 -1.544030 -0.39733

In [20]:
df[(df["Column1"] > 0) & (df["Column3"] < 0)]

    Column1   Column2   Column3   Column4
c  0.117369 -0.014371 -1.575668 -1.273715

In [18]:
df

    Column1   Column2   Column3   Column4
a -1.828176  0.868624  0.806492  0.779450
b -0.387825 -0.021886 -1.544030 -0.397330
c  0.117369 -0.014371 -1.575668 -1.273715

In [23]:
df[(df["Column1"] > 0) | (df["Column3"] < 0)]

    Column1   Column2   Column3   Column4
b -0.387825 -0.021886 -1.544030 -0.397330
c  0.117369 -0.014371 -1.575668 -1.273715

In [24]:
df

    Column1   Column2   Column3   Column4
a -1.828176  0.868624  0.806492  0.779450
b -0.387825 -0.021886 -1.544030 -0.397330
c  0.117369 -0.014371 -1.575668 -1.273715

In [25]:
df["Column5"] =randn(3)

In [26]:
df

    Column1   Column2   Column3   Column4   Column5
a -1.828176  0.868624  0.806492  0.779450 -1.315182
b -0.387825 -0.021886 -1.544030 -0.397330  0.794940
c  0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [27]:
df["Satırlar"]=["1.SATIR","2.SATIR","3.SATIR"]

In [28]:
df

    Column1   Column2   Column3   Column4   Column5 Satırlar
a -1.828176  0.868624  0.806492  0.779450 -1.315182  1.SATIR
b -0.387825 -0.021886 -1.544030 -0.397330  0.794940  2.SATIR
c  0.117369 -0.014371 -1.575668 -1.273715  0.566828  3.SATIR

In [29]:
df.set_index("Satırlar")

           Column1   Column2   Column3   Column4   Column5
Satırlar
1.SATIR  -1.828176  0.868624  0.806492  0.779450 -1.315182
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [30]:
df

    Column1   Column2   Column3   Column4   Column5 Satırlar
a -1.828176  0.868624  0.806492  0.779450 -1.315182  1.SATIR
b -0.387825 -0.021886 -1.544030 -0.397330  0.794940  2.SATIR
c  0.117369 -0.014371 -1.575668 -1.273715  0.566828  3.SATIR

In [32]:
df.set_index("Satırlar",inplace=True)

In [33]:
df

           Column1   Column2   Column3   Column4   Column5
Satırlar
1.SATIR  -1.828176  0.868624  0.806492  0.779450 -1.315182
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [39]:
df.set_axis(["1.SÜTUN","2. SÜTUN","3.sÜTUN","4.sÜTUN","5.sÜTUN"],axis='columns',inplace=True)

In [40]:
df

           1.SÜTUN  2. SÜTUN   3.sÜTUN   4.sÜTUN   5.sÜTUN
Satırlar
1.SATIR  -1.828176  0.868624  0.806492  0.779450 -1.315182
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [41]:
df.index.name

'Satırlar'

In [46]:
df.rename_axis("Sütunlar",axis='columns')

Sütunlar   1.SÜTUN  2. SÜTUN   3.sÜTUN   4.sÜTUN   5.sÜTUN
Satırlar
1.SATIR  -1.828176  0.868624  0.806492  0.779450 -1.315182
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [48]:
df[(df["1.SÜTUN"] > 0) | (df["3.sÜTUN"] < 0)]

           1.SÜTUN  2. SÜTUN   3.sÜTUN   4.sÜTUN   5.sÜTUN
Satırlar
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [49]:
df2=df[(df["1.SÜTUN"] > 0) | (df["3.sÜTUN"] < 0)]

In [50]:
df2

           1.SÜTUN  2. SÜTUN   3.sÜTUN   4.sÜTUN   5.sÜTUN
Satırlar
2.SATIR  -0.387825 -0.021886 -1.544030 -0.397330  0.794940
3.SATIR   0.117369 -0.014371 -1.575668 -1.273715  0.566828

In [51]:
df+df2

           1.SÜTUN  2. SÜTUN   3.sÜTUN   4.sÜTUN   5.sÜTUN
Satırlar
1.SATIR        NaN       NaN       NaN       NaN       NaN
2.SATIR  -0.775649 -0.043773 -3.088059 -0.794659  1.589881
3.SATIR   0.234738 -0.028741 -3.151336 -2.547429  1.133655